import React from 'react';



export default function Glossay() {
    return <ul>
        <li> Приказы
            <ul>
                <li>✊ Приказ поддержки</li>
                <li>👑 Приказ услиения власти</li>
                <li>🗡️ Приказ похода</li>
                <li>🛡️ Приказ обороны</li>
                <li>🔥 Приказ набега</li>
            </ul>
        </li>
        <li>
            Юниты на карте
            <ul>
                <li>🚶‍️ - пехотинец. 1 очко боевой силы</li>
                <li>♘ - Рыцарь. 2 очка боевой силы</li>
                <li>⛵ - корабль, флот. 1 очко боевой силы</li>
                <li>🚎 - осадная башня. 4 очка боевой силы в случае осады</li>
            </ul>
        </li>
        <li>
            Знаки
            <li>🗡️️ - знак меча️</li>
            <li>🏰 - знак крепости</li>
            <li>💀 - знак смерти</li>
        </li>
        <li>✊ Приказ поддержки</li>
        <li>✊ Приказ поддержки</li>
        <li>✊ Приказ поддержки</li>
        <li>✊ Приказ поддержки</li>
        <li>✊ Приказ поддержки</li>
        <li>✊ Приказ поддержки</li>

    </ul>
}